presentation/functor.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><p class="date">Created: 2020-05-11 Mon 06:40</p>
</section>
<section>
<section id="slide-org104c33b">
<h2 id="org104c33b"><span class="section-number-2">1</span> Functor</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
</section>
<section>
<section id="slide-org81d0212">
<h3 id="org81d0212"><span class="section-number-3">1.1</span> Type class review.</h3>
<p>
Type class as a parameterised trait
</p>
<div class="org-src-container">

<pre  class="src src-scala"><code trim><span style="color: #F0DFAF; font-weight: bold;">trait</span> <span style="color: #7CB8BB;">JsonWriter</span>[<span style="color: #BFEBBF;">A</span>] {
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">write</span>(value<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>)<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Json</span>
}
</code></pre>
</div>

</section>
<section id="slide-org81d0212-split">

<h3><span class="section-number-3">1.1</span> Type class review.</h3>
<p>
Instance of the type class
</p>
<div class="org-src-container">

<pre  class="src src-scala"><code trim><span style="color: #F0DFAF; font-weight: bold;">object</span> <span style="color: #BFEBBF;">JsonWriterInstances</span> {
  <span style="color: #DCDCCC; font-weight: bold;">implicit</span> <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">stringWriter</span><span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">JsonWriter</span>[<span style="color: #BFEBBF;">String</span>] <span style="color: #F0DFAF; font-weight: bold;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #7CB8BB;">JsonWriter</span>[<span style="color: #BFEBBF;">String</span>] {
      <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">write</span>(value<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">String</span>)<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Json</span> <span style="color: #F0DFAF; font-weight: bold;">=</span>
        <span style="color: #BFEBBF;">JsString</span>(value)
    }
}
</code></pre>
</div>


</section>
<section id="slide-org81d0212-split">

<h3><span class="section-number-3">1.1</span> Type class review.</h3>

<p>
Interface object
</p>
<div class="org-src-container">

<pre  class="src src-scala"><code trim>
<span style="color: #F0DFAF; font-weight: bold;">object</span> <span style="color: #BFEBBF;">Json</span> {
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">toJson</span>[<span style="color: #BFEBBF;">A</span>](value<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>)(<span style="color: #DCDCCC; font-weight: bold;">implicit</span> w<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">JsonWriter</span>[<span style="color: #BFEBBF;">A</span>])<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Json</span> <span style="color: #F0DFAF; font-weight: bold;">=</span>
    w.write(value)
}

</code></pre>
</div>

<p>
Usage
</p>
<div class="org-src-container">

<pre  class="src src-scala"><code trim><span style="color: #BFEBBF;">Json</span>.toJson(<span style="color: #CC9393;">"foo bar"</span>)
</code></pre>
</div>

</section>
<section id="slide-org81d0212-split">

<h3><span class="section-number-3">1.1</span> Type class review.</h3>

<p>
Interface syntax
</p>
<div class="org-src-container">

<pre  class="src src-scala"><code trim><span style="color: #DCDCCC; font-weight: bold;">implicit</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">JsonWriterOps</span>[<span style="color: #BFEBBF;">A</span>](value<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>) {
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">toJson</span>(<span style="color: #DCDCCC; font-weight: bold;">implicit</span> w<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">JsonWriter</span>[<span style="color: #BFEBBF;">A</span>])<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Json</span> <span style="color: #F0DFAF; font-weight: bold;">=</span>
    w.write(value)
}
</code></pre>
</div>

<p>
Usage
</p>
<div class="org-src-container">

<pre  class="src src-scala"><code trim><span style="color: #CC9393;">"foo bar"</span>.toJson
<span style="color: #BFEBBF;">1.</span>toJson
<span style="color: #BFEBBF;">Person</span>(<span style="color: #CC9393;">"John"</span>, <span style="color: #CC9393;">"Smith"</span>).toJson
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-orgeb2eb48">
<h3 id="orgeb2eb48"><span class="section-number-3">1.2</span> Monoid review</h3>
<div class="org-src-container">

<pre  class="src src-scala"><code trim>
<span style="color: #F0DFAF; font-weight: bold;">trait</span> <span style="color: #7CB8BB;">Monoid</span>[<span style="color: #BFEBBF;">A</span>] {
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">combine</span>(x<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>, y<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>)<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">empty</span><span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>
}
</code></pre>
</div>

</section>
<section id="slide-orgeb2eb48-split">

<h3><span class="section-number-3">1.2</span> Monoid review</h3>
<div class="org-src-container">

<pre  class="src src-scala"><code trim><span style="color: #F0DFAF; font-weight: bold;">object</span> <span style="color: #BFEBBF;">MonoidLaws</span> {

  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">(1 + 2) + 3 == 1 + (2 + 3)</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">associativeLaw</span>[<span style="color: #BFEBBF;">A</span>](x<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>, y<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>, z<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>)(<span style="color: #DCDCCC; font-weight: bold;">implicit</span> m<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Monoid</span>[<span style="color: #BFEBBF;">A</span>])<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Boolean</span> <span style="color: #F0DFAF; font-weight: bold;">=</span> {
    m.combine(x, m.combine(y, z)) ==
    m.combine(m.combine(x, y), z)
  }

  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">2 + 0 == 0 + 2 == 2</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">identityLaw</span>[<span style="color: #BFEBBF;">A</span>](x<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>)(<span style="color: #DCDCCC; font-weight: bold;">implicit</span> m<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Monoid</span>[<span style="color: #BFEBBF;">A</span>])<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Boolean</span> <span style="color: #F0DFAF; font-weight: bold;">=</span> {
    (m.combine(x, m.empty) == x) &amp;&amp;
    (m.combine(m.empty, x) == x)
  }
}

</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-org15801fd">
<h3 id="org15801fd"><span class="section-number-3">1.3</span> Functor</h3>
<div class="outline-text-3" id="text-1-3">
</div>
</section>
<section id="slide-org85d6272">
<h4 id="org85d6272"><span class="section-number-4">1.3.1</span> Informal definition</h4>
<p class="fragment roll-in">
Functor is anything with a map method.
</p>

<div class="org-src-container">

<pre  class="fragment roll-in"><code trim><span style="color: #F0DFAF; font-weight: bold;">trait</span> <span style="color: #7CB8BB;">Functor</span>[<span style="color: #BFEBBF;">F</span>[<span style="color: #F0DFAF; font-weight: bold;">_</span>]] {
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">map</span>[<span style="color: #BFEBBF;">A</span>, <span style="color: #BFEBBF;">B</span>](fa<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">F</span>[<span style="color: #BFEBBF;">A</span>])(f<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span> <span style="color: #F0DFAF; font-weight: bold;">=&gt;</span> <span style="color: #BFEBBF;">B</span>)<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">F</span>[<span style="color: #BFEBBF;">B</span>]
}
</code></pre>
</div>

<p class="fragment roll-in">
<i>Compare type paremeter to Monoid type class.</i>
</p>
<div class="org-src-container">

<pre  class="fragment roll-in"><code trim><span style="color: #F0DFAF; font-weight: bold;">trait</span> <span style="color: #7CB8BB;">Monoid</span>[<span style="color: #BFEBBF;">A</span>] {
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">combine</span>(x<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>, y<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>)<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">empty</span><span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">A</span>
}

</code></pre>
</div>

</section>
<section id="slide-org0dfebaa">
<h4 id="org0dfebaa"><span class="section-number-4">1.3.2</span> Type constructors</h4>
<pre  class="example">
scala&gt; :k Int
Int's kind is A

scala&gt; :k List
List's kind is F[+A]

scala&gt; :k Option
Option's kind is F[+A]

scala&gt; :k Either
Either's kind is F[+A1,+A2]

scala&gt; :k Future
scala.concurrent.Future's kind is F[+A]
</pre>

</section>
<section id="slide-org2ed43da">
<h4 id="org2ed43da"><span class="section-number-4">1.3.3</span> Examples of Functors</h4>
<pre  class="example">

scala&gt; List(1,2,4).map(n =&gt; n + 10)
val res1: List[Int] = List(11, 12, 14)

scala&gt;
</pre>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
